apps/contributions/tests/fixtures/charge-refunded-recurring-first-charge-event.json

{
    "id": "evt_3O5Xr1PbhdfvD1kV1p9iGLT1",
    "object": "event",
    "account": "acct_1JhHQsPbhdfvD1kV",
    "api_version": "2020-08-27",
    "created": 1698422154,
    "data": {
        "object": {
            "id": "ch_3O5Xr1PbhdfvD1kV1sQggtKL",
            "object": "charge",
            "amount": 36500,
            "amount_captured": 36500,
            "amount_refunded": 36500,
            "application": "ca_JGxDCnO08VRFiIKWUuBfOmOx70wFiBW0",
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_3O5Xr1PbhdfvD1kV1uH7RMrI",
            "billing_details": {
                "address": {
                    "city": "Warszawa",
                    "country": "PL",
                    "line1": "124 Górczewska",
                    "line2": "",
                    "postal_code": "01-460",
                    "state": "Mazowieckie"
                },
                "email": "ben.white+approved@fundjournalism.org",
                "name": "ben white",
                "phone": "234"
            },
            "calculated_statement_descriptor": "WWW.WLRN.ORG",
            "captured": true,
            "created": 1698343236,
            "currency": "usd",
            "customer": "cus_OtKWAQ0I1QPKmQ",
            "description": "Subscription creation",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "invoice": "in_1O5Xr1PbhdfvD1kV3Be7zDvZ",
            "livemode": false,
            "metadata": {},
            "on_behalf_of": null,
            "order": null,
            "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "risk_score": 18,
                "seller_message": "Payment complete.",
                "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3O5Xr1PbhdfvD1kV17sb3B1K",
            "payment_method": "pm_1O5XrEPbhdfvD1kVexmmV7b1",
            "payment_method_details": {
                "card": {
                    "amount_authorized": 36500,
                    "brand": "visa",
                    "checks": {
                        "address_line1_check": "pass",
                        "address_postal_code_check": "pass",
                        "cvc_check": "pass"
                    },
                    "country": "US",
                    "exp_month": 12,
                    "exp_year": 2023,
                    "extended_authorization": {
                        "status": "disabled"
                    },
                    "fingerprint": "t3Nk1zg9IfbJoyRi",
                    "funding": "credit",
                    "incremental_authorization": {
                        "status": "unavailable"
                    },
                    "installments": null,
                    "last4": "4242",
                    "mandate": null,
                    "multicapture": {
                        "status": "unavailable"
                    },
                    "network": "visa",
                    "network_token": {
                        "used": false
                    },
                    "overcapture": {
                        "maximum_amount_capturable": 36500,
                        "status": "unavailable"
                    },
                    "three_d_secure": null,
                    "wallet": null
                },
                "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xSmhIUXNQYmhkZnZEMWtWKIq776kGMgauommw7Ow6LBY0-FBH6Wp2cxI_0sUg80RacWSiiHC72o3wx3n6Wrcj9tBQGuMahmJ5sfZD?s=ap",
            "refunded": true,
            "refunds": {
                "object": "list",
                "data": [
                    {
                        "id": "re_3O5Xr1PbhdfvD1kV1qbXKznS",
                        "object": "refund",
                        "amount": 36500,
                        "balance_transaction": "txn_3O5Xr1PbhdfvD1kV1zQqBP1l",
                        "charge": "ch_3O5Xr1PbhdfvD1kV1sQggtKL",
                        "created": 1698422153,
                        "currency": "usd",
                        "metadata": {},
                        "payment_intent": "pi_3O5Xr1PbhdfvD1kV17sb3B1K",
                        "reason": "requested_by_customer",
                        "receipt_number": null,
                        "source_transfer_reversal": null,
                        "status": "succeeded",
                        "transfer_reversal": null
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/charges/ch_3O5Xr1PbhdfvD1kV1sQggtKL/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
        },
        "previous_attributes": {
            "amount_refunded": 0,
            "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xSmhIUXNQYmhkZnZEMWtWKIm776kGMgZ_thnrVQ86LBYv0lsnhVySSYkWpTk_qiCycUuoBgWs3DuwyDoUak4Gaha-zajNr66wyWt0?s=ap",
            "refunded": false,
            "refunds": {
                "data": [],
                "total_count": 0
            }
        }
    },
    "livemode": false,
    "pending_webhooks": 2,
    "request": {
        "id": "req_9RgtYo8WgnWgNk",
        "idempotency_key": "5a51cba8-d3e9-4abe-9420-f93ad136792c"
    },
    "type": "charge.refunded"
}
