apps/contributions/tests/fixtures/invoice-payment-succeeded-event.json

{
    "id": "evt_fakefakefake",
    "object": "event",
    "account": "acct_fakefakefake",
    "api_version": "2020-08-27",
    "created": 1698691254,
    "data": {
        "object": {
            "id": "in_fakefakefake",
            "object": "invoice",
            "account_country": "US",
            "account_name": "FOO",
            "account_tax_ids": null,
            "amount_due": 2000,
            "amount_paid": 2000,
            "amount_remaining": 0,
            "amount_shipping": 0,
            "application": "ca_fakefakefake",
            "application_fee_amount": null,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "automatic_tax": {
                "enabled": false,
                "status": null
            },
            "billing_reason": "subscription_cycle",
            "charge": "ch_fakefakefake",
            "collection_method": "charge_automatically",
            "created": 1703948195,
            "currency": "usd",
            "custom_fields": null,
            "customer": "cus_fakefakefake",
            "customer_address": null,
            "customer_email": "foo@bar.org",
            "customer_name": "Foo Bar",
            "customer_phone": null,
            "customer_shipping": {
                "address": {
                    "city": "",
                    "country": "",
                    "line1": "",
                    "line2": "",
                    "postal_code": "",
                    "state": ""
                },
                "name": "Foo Bar",
                "phone": ""
            },
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "effective_at": 1703951795,
            "ending_balance": 0,
            "footer": null,
            "from_invoice": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_fakefakefake/test_fakefakefake",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_fakefakefake/test_fakefakefake",
            "last_finalization_error": null,
            "latest_revision": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_fakefakefake",
                        "object": "line_item",
                        "amount": 2000,
                        "amount_excluding_tax": 2000,
                        "currency": "usd",
                        "description": "1 × myproduct (at $20.00 / month)",
                        "discount_amounts": [],
                        "discountable": true,
                        "discounts": [],
                        "livemode": false,
                        "metadata": {
                            "referer": "https://foo.bar.org/",
                            "donor_selected_amount": "18",
                            "revenue_program_id": "3",
                            "source": "rev-engine",
                            "swag_opt_out": "false",
                            "contributor_id": "183",
                            "agreed_to_pay_fees": "false",
                            "revenue_program_slug": "foo-bar",
                            "schema_version": "1.4"
                        },
                        "period": {
                            "end": 1706626595,
                            "start": 1703948195
                        },
                        "plan": {
                            "id": "plan_fakefakefake",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 2000,
                            "amount_decimal": "2000",
                            "billing_scheme": "per_unit",
                            "created": 1668409559,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_fakefakefake",
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "plan_fakefakefake",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1668409559,
                            "currency": "usd",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_fakefakefake",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 2000,
                            "unit_amount_decimal": "2000"
                        },
                        "proration": false,
                        "proration_details": {
                            "credited_items": null
                        },
                        "quantity": 1,
                        "subscription": "sub_fakefakefake",
                        "subscription_item": "si_OupZb08LG0vagt",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "subscription",
                        "unit_amount_excluding_tax": "2000"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_fakefakefake/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "026136E9-0003",
            "on_behalf_of": null,
            "paid": true,
            "paid_out_of_band": false,
            "payment_intent": "pi_fakefakefake",
            "payment_settings": {
                "default_mandate": null,
                "payment_method_options": null,
                "payment_method_types": null
            },
            "period_end": 1703948195,
            "period_start": 1701356195,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "quote": null,
            "receipt_number": null,
            "rendering": null,
            "rendering_options": null,
            "shipping_cost": null,
            "shipping_details": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1703951795,
                "marked_uncollectible_at": null,
                "paid_at": 1703951795,
                "voided_at": null
            },
            "subscription": "sub_fakefakefake",
            "subscription_details": {
                "metadata": {
                    "referer": "https://foo.bar.org/",
                    "donor_selected_amount": "18",
                    "revenue_program_id": "3",
                    "source": "rev-engine",
                    "swag_opt_out": "false",
                    "contributor_id": "183",
                    "agreed_to_pay_fees": "false",
                    "revenue_program_slug": "foo-bar",
                    "schema_version": "1.4"
                }
            },
            "subtotal": 2000,
            "subtotal_excluding_tax": 2000,
            "tax": null,
            "test_clock": null,
            "total": 2000,
            "total_discount_amounts": [],
            "total_excluding_tax": 2000,
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1703948195
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": null,
        "idempotency_key": null
    },
    "type": "invoice.payment_succeeded"
}
