apps/contributions/tests/fixtures/payment-intent-for-subscription-creation-charge.json

{
    "id": "pi_fakefakefake",
    "object": "payment_intent",
    "amount": 36500,
    "amount_capturable": 0,
    "amount_details": {
        "tip": {}
    },
    "amount_received": 36500,
    "application": "ca_fakefakefake",
    "application_fee_amount": null,
    "automatic_payment_methods": null,
    "canceled_at": null,
    "cancellation_reason": null,
    "capture_method": "automatic",
    "charges": {
        "object": "list",
        "data": [
            {
                "id": "ch_fakefakefake",
                "object": "charge",
                "amount": 36500,
                "amount_captured": 36500,
                "amount_refunded": 0,
                "application": "ca_fakefakefake",
                "application_fee": null,
                "application_fee_amount": null,
                "balance_transaction": "txn_fakefakefake888888",
                "billing_details": {
                    "address": {
                        "city": "Warszawa",
                        "country": "PL",
                        "line1": "124 Górczewska",
                        "line2": "",
                        "postal_code": "01-460",
                        "state": "Mazowieckie"
                    },
                    "email": "foo@bar.org",
                    "name": "foo bar",
                    "phone": "234"
                },
                "calculated_statement_descriptor": "WWW.FOO.ORG",
                "captured": true,
                "created": 1698343236,
                "currency": "usd",
                "customer": "cus_fakefakefake",
                "description": "Subscription creation",
                "destination": null,
                "dispute": null,
                "disputed": false,
                "failure_balance_transaction": null,
                "failure_code": null,
                "failure_message": null,
                "fraud_details": {},
                "invoice": "in_fakefakefake",
                "livemode": false,
                "metadata": {},
                "on_behalf_of": null,
                "order": null,
                "outcome": {
                    "network_status": "approved_by_network",
                    "reason": null,
                    "risk_level": "normal",
                    "risk_score": 18,
                    "seller_message": "Payment complete.",
                    "type": "authorized"
                },
                "paid": true,
                "payment_intent": "pi_fakefakefake",
                "payment_method": "pm_fakefakefake",
                "payment_method_details": {
                    "card": {
                        "amount_authorized": 36500,
                        "brand": "visa",
                        "checks": {
                            "address_line1_check": "pass",
                            "address_postal_code_check": "pass",
                            "cvc_check": "pass"
                        },
                        "country": "US",
                        "exp_month": 12,
                        "exp_year": 2023,
                        "extended_authorization": {
                            "status": "disabled"
                        },
                        "fingerprint": "fakefakefake",
                        "funding": "credit",
                        "incremental_authorization": {
                            "status": "unavailable"
                        },
                        "installments": null,
                        "last4": "4242",
                        "mandate": null,
                        "multicapture": {
                            "status": "unavailable"
                        },
                        "network": "visa",
                        "network_token": {
                            "used": false
                        },
                        "overcapture": {
                            "maximum_amount_capturable": 36500,
                            "status": "unavailable"
                        },
                        "three_d_secure": null,
                        "wallet": null
                    },
                    "type": "card"
                },
                "receipt_email": null,
                "receipt_number": null,
                "receipt_url": "https://pay.stripe.com/receipts/invoices/fake?s=ap",
                "refunded": false,
                "refunds": {
                    "object": "list",
                    "data": [],
                    "has_more": false,
                    "total_count": 0,
                    "url": "/v1/charges/ch_fakefakefake/refunds"
                },
                "review": null,
                "shipping": null,
                "source": null,
                "source_transfer": null,
                "statement_descriptor": null,
                "statement_descriptor_suffix": null,
                "status": "succeeded",
                "transfer_data": null,
                "transfer_group": null
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_fakefakefake"
    },
    "client_secret": "pi_fakefakefake_secret_fakefakefake",
    "confirmation_method": "automatic",
    "created": 1698343223,
    "currency": "usd",
    "customer": "cus_fakefakefake",
    "description": "Subscription creation",
    "invoice": "in_fakefakefake",
    "last_payment_error": null,
    "latest_charge": "ch_fakefakefake",
    "livemode": false,
    "metadata": {},
    "next_action": null,
    "on_behalf_of": null,
    "payment_method": "pm_fakefakefake",
    "payment_method_configuration_details": null,
    "payment_method_options": {
        "card": {
            "installments": null,
            "mandate_options": null,
            "network": null,
            "request_three_d_secure": "automatic"
        },
        "cashapp": {}
    },
    "payment_method_types": [
        "card",
        "cashapp"
    ],
    "processing": null,
    "receipt_email": null,
    "review": null,
    "setup_future_usage": "off_session",
    "shipping": null,
    "source": null,
    "statement_descriptor": null,
    "statement_descriptor_suffix": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
}
